/**
 * Created by doyen on 2015/11/5.
 */
define([

], function () {
	function initialize () {
		var module = angular.module("Controllers");

		module.controller("educationController", [
			"$scope",
			function ($scope) {
				$scope.educationData = [
					{
						stage: "小学",
						name: "Primary",
						date: "1998.09.01-2003.07.01",
						title: "童真的少年，拥有最纯洁的回忆",
						list: [
							"从四岁开始就渴望读书",
							"小时候被老师誉为抄作业的冠军",
							"怀恋六一儿童节发糖，带红领巾的情形",
							"怀念一袋炸土豆就满足兴奋的样子",
							"怀念小伙伴们一起玩游戏的情形",
							"怀念老师领着我们春游的日子",
							"怀念每天放学和小伙伴一起在清澈的河里泡澡的情形",
							"怀念和小伙伴们一起骑自行车的威武",
							"无忧无虑，只有欢快，没有烦恼",
							"小学六年是每个人生命中最宝贵的六年",
							"看到现在的小学生，仿佛想起了曾经的自己，在不经意间，我们已经慢慢老去",
							"人间有情，岁月无情，过去的不会再回来"
						]
					},
					{
						stage: "初中",
						name: "Junior",
						date: "2003.09.01-2005.07.01",
						title: "追逐古惑仔的年代，在打打杀杀中成长.",
						list: [
							"每天都骑自行车上下学，风雨无阻",
							"每天都在追追打打中度过",
							"古惑仔席卷了整个校园，时常有打架发生，甚至老师也会被打",
							"每天都被老师留下来背书",
							"怀恋一块五一顿的午餐，还一大堆肉的食堂",
							"初中老师的责任心让我们感动",
							"那是一个玩大型游戏机的年代，三国战记，拳皇98则是我们的最爱",
						]
					},
					{
						stage: "高中",
						name: "Senior",
						date: "2005.09.01-2007.07.01",
						title: "追星的年代，NBA，足球，韦德、卡卡伴随我踏入大学的校门",
						list: [
							"迷恋上了NBA，足球",
							"世界杯让我们沸腾",
							"怀恋砸食堂的事情",
							"怀恋通宵斗地主的时光",
							"翻墙出去上网看世界杯，激情四射",
							"全班旷课看火箭VS湖人季后赛，仿佛就在昨天",
							"通宵玩PS实况，精神上的享受",
							"英语是我的伤痛，从来没有尝试过及格是什么滋味",
							"最终高考失利，痛苦"
						]
					},
					{
						stage: "高补",
						name: "Tutorial",
						date: "2007.09.01-2009.07.01",
						title: "追星的年代，NBA，足球，韦德、卡卡伴随我踏入大学的校门",
						list: [
							"为了大学，我又来了",
							"开始迷恋上斯洛克，旷课玩斯洛克",
							"斯洛克伴随我度过了两年的补习生涯，我也成为了一个斯洛克高手",
							"最纯真的友谊，没有丝毫的利益关系",
							"经历了汶川大地震，很庆幸，我们死里逃生，如果时间再停留那么几秒钟，或许整个学校已经崩塌"
						]
					},
					{
						stage: "大学",
						name: "University",
						date: "2009.09.01-2013.07.01",
						title: "花样年华，只可惜也是天才损落的地方，无数有志青年在这里不断沉沦.",
						list: [
							"带着梦想，来到了向往的圣地，踏进了大学的校园",
							"不断的努力学习，教室、食堂、图书馆、实验室，每天都是四点一线",
							"寝室里弥漫着无穷无尽的游戏气息，我慢慢意思到大学原来是让人不断沉沦的地方",
							"大学原来这么腐败，学习优异的人不能入党，整体打游戏，挂了无数科的人，却凭借着给老师塞红包入了党",
							"看看我们的老师在干嘛，接私单，开公司，问个问题，永远是明天再问，我赶时间要走了",
							"大学老师完全没有为人师表的样子，居然对自己的女学生想入菲菲，无耻下流混蛋",
							"毕业季，我们的老师和我们班的女学生，步入了婚姻的殿堂，我只能呵呵了",
							"难道这就是中国的大学吗，入党明码标价1200，这就是我的母校，不敢相信，真是以我的母校为耻",
							"成绩好就能拿到奖学金？不不不，在这里，唯一的机会就是和班主任搞好关系",
							"挂科了，怎么办？给科任老师送点小礼，什么都搞定",
							"四级考不过怎么办，只要你有钱，砸门万能的老师可以给你安排好位置，你懂得",
							"想读研怎么办？钱钱钱，只要你有钱，一切都好说",
							"终于带着优异的成绩毕业了，可是我发现现实是我们很难找到一份向样的工作",
							"终于明白了，石油大学，开电子专业，想找工作，做梦去吧",
							"思考，中国大学究竟给我们年轻人带来了什么，一句话浪费光阴，误入歧途",
							"如果上天再给我一次选择的机会，我绝不会踏进大学的校门，准确的说是绝对不会踏进中国大学的校门"
						]
					}
				];
			}
		]);
	};

	return {initialize: initialize};
});